Revit 2025 API
Zone.HumidificationSetPoint Property
Get or set the Humidification Set Point of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double HumidificationSetPoint { get; set; }
Public Property HumidificationSetPoint As Double
	Get
	Set
public:
property double HumidificationSetPoint {
	double get ();
	void set (double value);
}
member HumidificationSetPoint : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Humidification Set Point of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace